system/snappygeometry
parts2_v1.stl { type triSurfaceMesh; file "parts2_v1.stl"; name external1; } 
