system/snappyrefinementsurfaces
external1 { level (2 4); } 
